polished  readme
